mysql_standalone_benchmarkv1.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Target transaction rate: 40/sec
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 8 tps: 42.89 qps: 857.86 (r/w/o: 600.50/171.57/85.79) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 1s ] queue length: 0, concurrency: 0
[ 2s ] thds: 8 tps: 40.02 qps: 800.32 (r/w/o: 560.22/160.06/80.03) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 2s ] queue length: 0, concurrency: 0
[ 3s ] thds: 8 tps: 35.00 qps: 700.03 (r/w/o: 490.02/140.01/70.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 3s ] queue length: 0, concurrency: 0
[ 4s ] thds: 8 tps: 38.00 qps: 779.01 (r/w/o: 546.01/156.00/77.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 4s ] queue length: 0, concurrency: 1
[ 5s ] thds: 8 tps: 32.00 qps: 620.99 (r/w/o: 434.00/124.00/63.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 5s ] queue length: 0, concurrency: 0
[ 6s ] thds: 8 tps: 31.00 qps: 620.01 (r/w/o: 434.01/124.00/62.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 6s ] queue length: 0, concurrency: 0
[ 7s ] thds: 8 tps: 39.99 qps: 799.88 (r/w/o: 559.91/159.98/79.99) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 7s ] queue length: 0, concurrency: 0
[ 8s ] thds: 8 tps: 42.01 qps: 840.11 (r/w/o: 588.08/168.02/84.01) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 8s ] queue length: 1, concurrency: 0
[ 9s ] thds: 8 tps: 48.00 qps: 960.00 (r/w/o: 672.00/192.00/96.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 9s ] queue length: 0, concurrency: 0
[ 10s ] thds: 8 tps: 34.00 qps: 680.02 (r/w/o: 476.01/136.00/68.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 10s ] queue length: 0, concurrency: 0
[ 11s ] thds: 8 tps: 30.00 qps: 599.98 (r/w/o: 419.99/120.00/60.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 11s ] queue length: 0, concurrency: 0
[ 12s ] thds: 8 tps: 44.00 qps: 880.03 (r/w/o: 616.02/176.01/88.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 12s ] queue length: 0, concurrency: 0
[ 13s ] thds: 8 tps: 34.00 qps: 679.98 (r/w/o: 475.98/136.00/68.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 13s ] queue length: 0, concurrency: 0
[ 14s ] thds: 8 tps: 44.00 qps: 880.00 (r/w/o: 616.00/176.00/88.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 14s ] queue length: 0, concurrency: 0
[ 15s ] thds: 8 tps: 31.00 qps: 620.00 (r/w/o: 434.00/124.00/62.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 15s ] queue length: 0, concurrency: 0
[ 16s ] thds: 8 tps: 37.00 qps: 759.01 (r/w/o: 532.01/152.00/75.00) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 16s ] queue length: 0, concurrency: 1
[ 17s ] thds: 8 tps: 37.00 qps: 720.93 (r/w/o: 503.95/143.99/72.99) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 17s ] queue length: 0, concurrency: 0
[ 18s ] thds: 8 tps: 31.00 qps: 620.08 (r/w/o: 434.05/124.02/62.01) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 18s ] queue length: 0, concurrency: 0
[ 19s ] thds: 8 tps: 36.00 qps: 719.93 (r/w/o: 503.95/143.99/71.99) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 19s ] queue length: 0, concurrency: 0
[ 20s ] thds: 8 tps: 37.00 qps: 749.06 (r/w/o: 526.04/148.01/75.01) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 20s ] queue length: 0, concurrency: 1
[ 21s ] thds: 8 tps: 41.00 qps: 810.94 (r/w/o: 565.96/163.99/80.99) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 21s ] queue length: 0, concurrency: 0
[ 22s ] thds: 8 tps: 40.00 qps: 800.09 (r/w/o: 560.06/160.02/80.01) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 22s ] queue length: 0, concurrency: 0
[ 23s ] thds: 8 tps: 42.99 qps: 859.83 (r/w/o: 601.88/171.97/85.98) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 23s ] queue length: 0, concurrency: 0
[ 24s ] thds: 8 tps: 33.01 qps: 660.11 (r/w/o: 462.08/132.02/66.01) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 24s ] queue length: 0, concurrency: 0
[ 25s ] thds: 8 tps: 41.00 qps: 819.96 (r/w/o: 573.97/163.99/82.00) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 25s ] queue length: 0, concurrency: 0
[ 26s ] thds: 8 tps: 44.00 qps: 879.93 (r/w/o: 615.95/175.99/87.99) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 26s ] queue length: 0, concurrency: 1
[ 27s ] thds: 8 tps: 50.01 qps: 1000.12 (r/w/o: 700.08/200.02/100.01) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 27s ] queue length: 0, concurrency: 0
[ 28s ] thds: 8 tps: 38.00 qps: 760.01 (r/w/o: 532.00/152.00/76.00) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 28s ] queue length: 0, concurrency: 0
[ 29s ] thds: 8 tps: 48.00 qps: 978.95 (r/w/o: 685.97/195.99/97.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 29s ] queue length: 0, concurrency: 1
[ 30s ] thds: 8 tps: 43.00 qps: 841.07 (r/w/o: 588.05/168.01/85.01) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 30s ] queue length: 0, concurrency: 0
[ 31s ] thds: 8 tps: 38.00 qps: 759.98 (r/w/o: 531.99/152.00/76.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 31s ] queue length: 0, concurrency: 0
[ 32s ] thds: 8 tps: 49.99 qps: 999.88 (r/w/o: 699.91/199.98/99.99) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 32s ] queue length: 0, concurrency: 0
[ 33s ] thds: 8 tps: 41.01 qps: 839.13 (r/w/o: 588.09/168.03/83.01) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 33s ] queue length: 0, concurrency: 1
[ 34s ] thds: 8 tps: 37.99 qps: 740.89 (r/w/o: 517.93/147.98/74.99) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 34s ] queue length: 0, concurrency: 1
[ 35s ] thds: 8 tps: 41.01 qps: 858.12 (r/w/o: 602.08/172.02/84.01) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 35s ] queue length: 0, concurrency: 2
[ 36s ] thds: 8 tps: 34.00 qps: 641.98 (r/w/o: 447.99/128.00/66.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 36s ] queue length: 0, concurrency: 0
[ 37s ] thds: 8 tps: 42.00 qps: 877.93 (r/w/o: 615.95/175.99/85.99) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 37s ] queue length: 0, concurrency: 2
[ 38s ] thds: 8 tps: 33.00 qps: 641.02 (r/w/o: 448.02/128.00/65.00) lat (ms,95%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 38s ] queue length: 0, concurrency: 1
[ 39s ] thds: 8 tps: 45.00 qps: 938.03 (r/w/o: 658.02/188.01/92.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 39s ] queue length: 0, concurrency: 3
[ 40s ] thds: 8 tps: 46.00 qps: 863.07 (r/w/o: 602.05/172.01/89.01) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 40s ] queue length: 0, concurrency: 0
[ 41s ] thds: 8 tps: 50.00 qps: 999.91 (r/w/o: 699.94/199.98/99.99) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 41s ] queue length: 0, concurrency: 0
[ 42s ] thds: 8 tps: 29.00 qps: 579.99 (r/w/o: 405.99/116.00/58.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 42s ] queue length: 0, concurrency: 0
[ 43s ] thds: 8 tps: 39.00 qps: 810.04 (r/w/o: 570.03/160.01/80.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 43s ] queue length: 0, concurrency: 2
[ 44s ] thds: 8 tps: 48.99 qps: 968.86 (r/w/o: 675.90/195.97/96.99) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 44s ] queue length: 0, concurrency: 1
[ 45s ] thds: 8 tps: 34.00 qps: 680.08 (r/w/o: 476.06/136.02/68.01) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 45s ] queue length: 0, concurrency: 1
[ 46s ] thds: 8 tps: 42.00 qps: 820.93 (r/w/o: 573.95/163.99/82.99) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 46s ] queue length: 0, concurrency: 0
[ 47s ] thds: 8 tps: 38.00 qps: 796.06 (r/w/o: 560.05/158.01/78.01) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 47s ] queue length: 0, concurrency: 2
[ 48s ] thds: 8 tps: 37.00 qps: 723.04 (r/w/o: 504.03/146.01/73.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 48s ] queue length: 0, concurrency: 1
[ 49s ] thds: 8 tps: 48.00 qps: 950.96 (r/w/o: 666.98/187.99/96.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 49s ] queue length: 0, concurrency: 1
[ 50s ] thds: 8 tps: 44.00 qps: 889.00 (r/w/o: 621.00/180.00/88.00) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 50s ] queue length: 0, concurrency: 1
[ 51s ] thds: 8 tps: 41.00 qps: 800.99 (r/w/o: 559.99/160.00/81.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 51s ] queue length: 0, concurrency: 0
[ 52s ] thds: 8 tps: 40.00 qps: 799.92 (r/w/o: 559.95/159.98/79.99) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 52s ] queue length: 0, concurrency: 1
[ 53s ] thds: 8 tps: 42.00 qps: 859.05 (r/w/o: 602.03/172.01/85.00) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 53s ] queue length: 0, concurrency: 1
[ 54s ] thds: 8 tps: 41.00 qps: 820.06 (r/w/o: 574.04/164.01/82.01) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 54s ] queue length: 0, concurrency: 1
[ 55s ] thds: 8 tps: 41.00 qps: 808.97 (r/w/o: 566.98/159.99/82.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 55s ] queue length: 0, concurrency: 1
[ 56s ] thds: 8 tps: 47.00 qps: 932.04 (r/w/o: 651.03/188.01/93.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 56s ] queue length: 0, concurrency: 0
[ 57s ] thds: 8 tps: 40.00 qps: 799.98 (r/w/o: 559.98/160.00/80.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 57s ] queue length: 0, concurrency: 0
[ 58s ] thds: 8 tps: 37.00 qps: 740.01 (r/w/o: 518.01/148.00/74.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 58s ] queue length: 0, concurrency: 0
[ 59s ] thds: 8 tps: 30.00 qps: 600.04 (r/w/o: 420.03/120.01/60.00) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 59s ] queue length: 0, concurrency: 0
[ 60s ] thds: 8 tps: 47.00 qps: 958.94 (r/w/o: 671.96/191.99/94.99) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 60s ] queue length: 0, concurrency: 1
[ 61s ] thds: 8 tps: 37.00 qps: 720.95 (r/w/o: 503.96/143.99/72.99) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 61s ] queue length: 0, concurrency: 1
[ 62s ] thds: 8 tps: 43.00 qps: 879.05 (r/w/o: 616.04/176.01/87.01) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 62s ] queue length: 0, concurrency: 1
[ 63s ] thds: 8 tps: 54.00 qps: 1061.00 (r/w/o: 742.00/212.00/107.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 63s ] queue length: 0, concurrency: 0
[ 64s ] thds: 8 tps: 31.00 qps: 620.00 (r/w/o: 434.00/124.00/62.00) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 64s ] queue length: 0, concurrency: 0
[ 65s ] thds: 8 tps: 34.00 qps: 680.00 (r/w/o: 476.00/136.00/68.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 65s ] queue length: 0, concurrency: 0
[ 66s ] thds: 8 tps: 49.00 qps: 999.01 (r/w/o: 700.01/200.00/99.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 66s ] queue length: 0, concurrency: 1
[ 67s ] thds: 8 tps: 34.00 qps: 660.98 (r/w/o: 461.99/132.00/67.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 67s ] queue length: 0, concurrency: 0
[ 68s ] thds: 8 tps: 38.00 qps: 760.06 (r/w/o: 532.04/152.01/76.01) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 68s ] queue length: 0, concurrency: 0
[ 69s ] thds: 8 tps: 41.00 qps: 819.97 (r/w/o: 573.98/163.99/82.00) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 69s ] queue length: 0, concurrency: 0
[ 70s ] thds: 8 tps: 52.00 qps: 1040.00 (r/w/o: 728.00/208.00/104.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 70s ] queue length: 0, concurrency: 0
[ 71s ] thds: 8 tps: 28.00 qps: 560.00 (r/w/o: 392.00/112.00/56.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 71s ] queue length: 0, concurrency: 0
[ 72s ] thds: 8 tps: 21.00 qps: 435.98 (r/w/o: 307.99/85.00/43.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 72s ] queue length: 0, concurrency: 1
[ 73s ] thds: 8 tps: 43.00 qps: 843.93 (r/w/o: 587.95/170.99/84.99) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 73s ] queue length: 0, concurrency: 1
[ 74s ] thds: 8 tps: 34.00 qps: 680.08 (r/w/o: 476.05/136.02/68.01) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 74s ] queue length: 0, concurrency: 0
[ 75s ] thds: 8 tps: 39.00 qps: 781.03 (r/w/o: 546.02/156.01/79.00) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 75s ] queue length: 0, concurrency: 1
[ 76s ] thds: 8 tps: 43.99 qps: 878.81 (r/w/o: 615.86/175.96/86.98) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 76s ] queue length: 0, concurrency: 1
[ 77s ] thds: 8 tps: 47.01 qps: 959.12 (r/w/o: 672.08/192.02/95.01) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 77s ] queue length: 0, concurrency: 1
[ 78s ] thds: 8 tps: 40.00 qps: 781.05 (r/w/o: 546.04/156.01/79.01) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 78s ] queue length: 0, concurrency: 0
[ 79s ] thds: 8 tps: 49.00 qps: 995.02 (r/w/o: 700.01/196.00/99.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 79s ] queue length: 0, concurrency: 1
[ 80s ] thds: 8 tps: 42.00 qps: 871.99 (r/w/o: 613.99/172.00/86.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 80s ] queue length: 0, concurrency: 3
[ 81s ] thds: 8 tps: 36.00 qps: 672.94 (r/w/o: 463.96/139.99/68.99) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 81s ] queue length: 0, concurrency: 0
[ 82s ] thds: 8 tps: 39.00 qps: 780.06 (r/w/o: 546.04/156.01/78.01) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 82s ] queue length: 0, concurrency: 0
[ 83s ] thds: 8 tps: 43.00 qps: 878.99 (r/w/o: 616.00/176.00/87.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 83s ] queue length: 0, concurrency: 1
[ 84s ] thds: 8 tps: 40.00 qps: 780.93 (r/w/o: 545.95/155.99/78.99) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 84s ] queue length: 0, concurrency: 0
[ 85s ] thds: 8 tps: 45.00 qps: 900.05 (r/w/o: 630.04/180.01/90.01) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 85s ] queue length: 0, concurrency: 0
[ 86s ] thds: 8 tps: 45.00 qps: 900.00 (r/w/o: 630.00/180.00/90.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 86s ] queue length: 0, concurrency: 0
[ 87s ] thds: 8 tps: 45.00 qps: 900.05 (r/w/o: 630.04/180.01/90.01) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 87s ] queue length: 0, concurrency: 0
[ 88s ] thds: 8 tps: 37.00 qps: 758.99 (r/w/o: 531.99/152.00/75.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 88s ] queue length: 0, concurrency: 1
[ 89s ] thds: 8 tps: 34.00 qps: 660.96 (r/w/o: 461.98/131.99/67.00) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 89s ] queue length: 0, concurrency: 0
[ 90s ] thds: 8 tps: 38.00 qps: 782.04 (r/w/o: 547.03/156.01/79.00) lat (ms,95%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 90s ] queue length: 0, concurrency: 3
[ 91s ] thds: 8 tps: 40.00 qps: 778.00 (r/w/o: 545.00/156.00/77.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 91s ] queue length: 0, concurrency: 0
[ 92s ] thds: 8 tps: 37.00 qps: 740.01 (r/w/o: 518.01/148.00/74.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 92s ] queue length: 0, concurrency: 0
[ 93s ] thds: 8 tps: 38.00 qps: 775.94 (r/w/o: 545.96/152.99/76.99) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 93s ] queue length: 0, concurrency: 1
[ 94s ] thds: 8 tps: 30.00 qps: 584.03 (r/w/o: 406.02/119.01/59.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 94s ] queue length: 0, concurrency: 0
[ 95s ] thds: 8 tps: 39.00 qps: 799.00 (r/w/o: 560.00/160.00/79.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 95s ] queue length: 0, concurrency: 1
[ 96s ] thds: 8 tps: 45.00 qps: 884.03 (r/w/o: 618.02/176.01/90.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 96s ] queue length: 0, concurrency: 1
[ 97s ] thds: 8 tps: 44.00 qps: 879.99 (r/w/o: 615.99/176.00/88.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 97s ] queue length: 0, concurrency: 1
[ 98s ] thds: 8 tps: 41.00 qps: 835.02 (r/w/o: 586.01/167.00/82.00) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 98s ] queue length: 0, concurrency: 1
[ 99s ] thds: 8 tps: 51.00 qps: 1001.90 (r/w/o: 699.93/200.98/100.99) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 99s ] queue length: 0, concurrency: 0
[ 100s ] thds: 8 tps: 34.00 qps: 691.93 (r/w/o: 486.95/135.99/68.99) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 100s ] queue length: 0, concurrency: 1
[ 101s ] thds: 8 tps: 47.01 qps: 928.13 (r/w/o: 647.09/188.03/93.01) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 101s ] queue length: 0, concurrency: 0
[ 102s ] thds: 8 tps: 45.00 qps: 900.01 (r/w/o: 630.00/180.00/90.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 102s ] queue length: 0, concurrency: 0
[ 103s ] thds: 8 tps: 44.00 qps: 879.99 (r/w/o: 615.99/176.00/88.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 103s ] queue length: 0, concurrency: 0
[ 104s ] thds: 8 tps: 38.00 qps: 760.00 (r/w/o: 532.00/152.00/76.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 104s ] queue length: 0, concurrency: 0
[ 105s ] thds: 8 tps: 27.00 qps: 562.97 (r/w/o: 394.98/111.99/56.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 105s ] queue length: 0, concurrency: 2
[ 106s ] thds: 8 tps: 49.00 qps: 957.02 (r/w/o: 669.02/192.00/96.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 106s ] queue length: 0, concurrency: 0
[ 107s ] thds: 8 tps: 42.00 qps: 845.04 (r/w/o: 592.03/168.01/85.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 107s ] queue length: 0, concurrency: 1
[ 108s ] thds: 8 tps: 46.00 qps: 934.00 (r/w/o: 654.00/188.00/92.00) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 108s ] queue length: 0, concurrency: 1
[ 109s ] thds: 8 tps: 44.00 qps: 860.96 (r/w/o: 601.97/171.99/87.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 109s ] queue length: 0, concurrency: 0
[ 110s ] thds: 8 tps: 47.00 qps: 959.02 (r/w/o: 672.02/192.00/95.00) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 110s ] queue length: 0, concurrency: 1
[ 111s ] thds: 8 tps: 39.00 qps: 761.02 (r/w/o: 532.02/152.00/77.00) lat (ms,95%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 111s ] queue length: 0, concurrency: 0
[ 112s ] thds: 8 tps: 46.00 qps: 919.98 (r/w/o: 643.98/184.00/92.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 112s ] queue length: 0, concurrency: 0
[ 113s ] thds: 8 tps: 41.00 qps: 820.01 (r/w/o: 574.01/164.00/82.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 113s ] queue length: 0, concurrency: 0
[ 114s ] thds: 8 tps: 40.00 qps: 800.02 (r/w/o: 560.01/160.00/80.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 114s ] queue length: 0, concurrency: 0
[ 115s ] thds: 8 tps: 34.00 qps: 699.01 (r/w/o: 490.00/140.00/69.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 115s ] queue length: 0, concurrency: 1
[ 116s ] thds: 8 tps: 51.00 qps: 1000.94 (r/w/o: 699.96/199.99/100.99) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 116s ] queue length: 0, concurrency: 0
[ 117s ] thds: 8 tps: 44.00 qps: 880.10 (r/w/o: 616.07/176.02/88.01) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 117s ] queue length: 0, concurrency: 1
[ 118s ] thds: 8 tps: 50.00 qps: 999.92 (r/w/o: 699.94/199.98/99.99) lat (ms,95%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 118s ] queue length: 0, concurrency: 0
[ 119s ] thds: 8 tps: 34.00 qps: 679.98 (r/w/o: 475.99/136.00/68.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 119s ] queue length: 0, concurrency: 0
[ 120s ] thds: 8 tps: 30.00 qps: 619.01 (r/w/o: 434.01/124.00/61.00) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 120s ] queue length: 0, concurrency: 1
[ 121s ] thds: 8 tps: 60.00 qps: 1180.92 (r/w/o: 825.94/235.98/118.99) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 121s ] queue length: 0, concurrency: 0
[ 122s ] thds: 8 tps: 43.00 qps: 879.03 (r/w/o: 616.02/176.01/87.00) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 122s ] queue length: 0, concurrency: 1
[ 123s ] thds: 8 tps: 48.00 qps: 951.97 (r/w/o: 667.98/187.99/96.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 123s ] queue length: 0, concurrency: 1
[ 124s ] thds: 8 tps: 48.00 qps: 949.05 (r/w/o: 662.03/192.01/95.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 124s ] queue length: 0, concurrency: 0
[ 125s ] thds: 8 tps: 41.00 qps: 819.93 (r/w/o: 573.95/163.99/81.99) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 125s ] queue length: 0, concurrency: 1
[ 126s ] thds: 8 tps: 35.00 qps: 700.05 (r/w/o: 490.04/140.01/70.01) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 126s ] queue length: 0, concurrency: 0
[ 127s ] thds: 8 tps: 42.00 qps: 839.98 (r/w/o: 587.98/168.00/84.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 127s ] queue length: 0, concurrency: 0
[ 128s ] thds: 8 tps: 47.00 qps: 978.05 (r/w/o: 686.03/196.01/96.00) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 128s ] queue length: 0, concurrency: 2
[ 129s ] thds: 8 tps: 40.00 qps: 762.00 (r/w/o: 532.00/152.00/78.00) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 129s ] queue length: 0, concurrency: 0
[ 130s ] thds: 8 tps: 45.00 qps: 900.01 (r/w/o: 630.01/180.00/90.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 130s ] queue length: 0, concurrency: 0
[ 131s ] thds: 8 tps: 45.00 qps: 899.95 (r/w/o: 629.96/179.99/89.99) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 131s ] queue length: 0, concurrency: 0
[ 132s ] thds: 8 tps: 39.00 qps: 780.05 (r/w/o: 546.03/156.01/78.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 132s ] queue length: 0, concurrency: 0
[ 133s ] thds: 8 tps: 40.00 qps: 800.01 (r/w/o: 560.01/160.00/80.00) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 133s ] queue length: 0, concurrency: 0
[ 134s ] thds: 8 tps: 47.00 qps: 939.99 (r/w/o: 657.99/188.00/94.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 134s ] queue length: 0, concurrency: 0
[ 135s ] thds: 8 tps: 42.00 qps: 839.99 (r/w/o: 587.99/168.00/84.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 135s ] queue length: 0, concurrency: 0
[ 136s ] thds: 8 tps: 32.00 qps: 640.01 (r/w/o: 448.01/128.00/64.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 136s ] queue length: 0, concurrency: 0
[ 137s ] thds: 8 tps: 35.00 qps: 717.01 (r/w/o: 504.01/142.00/71.00) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 137s ] queue length: 0, concurrency: 1
[ 138s ] thds: 8 tps: 46.00 qps: 903.00 (r/w/o: 630.00/182.00/91.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 138s ] queue length: 0, concurrency: 0
[ 139s ] thds: 8 tps: 39.00 qps: 779.99 (r/w/o: 545.99/156.00/78.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 139s ] queue length: 0, concurrency: 0
[ 140s ] thds: 8 tps: 42.00 qps: 858.97 (r/w/o: 601.98/171.99/85.00) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 140s ] queue length: 0, concurrency: 1
[ 141s ] thds: 8 tps: 38.00 qps: 741.03 (r/w/o: 518.02/148.01/75.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 141s ] queue length: 0, concurrency: 0
[ 142s ] thds: 8 tps: 40.99 qps: 819.86 (r/w/o: 573.90/163.97/81.99) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 142s ] queue length: 0, concurrency: 1
[ 143s ] thds: 8 tps: 42.01 qps: 840.13 (r/w/o: 588.09/168.03/84.01) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 143s ] queue length: 0, concurrency: 0
[ 144s ] thds: 8 tps: 52.00 qps: 1040.06 (r/w/o: 728.04/208.01/104.01) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 144s ] queue length: 0, concurrency: 0
[ 145s ] thds: 8 tps: 29.00 qps: 617.96 (r/w/o: 433.97/123.99/60.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 145s ] queue length: 0, concurrency: 2
[ 146s ] thds: 8 tps: 48.00 qps: 933.06 (r/w/o: 653.04/184.01/96.01) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 146s ] queue length: 0, concurrency: 2
[ 147s ] thds: 8 tps: 50.00 qps: 1007.91 (r/w/o: 704.94/203.98/98.99) lat (ms,95%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 147s ] queue length: 0, concurrency: 1
[ 148s ] thds: 8 tps: 42.00 qps: 871.99 (r/w/o: 613.99/172.00/86.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 148s ] queue length: 0, concurrency: 3
[ 149s ] thds: 8 tps: 46.00 qps: 868.98 (r/w/o: 603.99/176.00/89.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 149s ] queue length: 0, concurrency: 0
[ 150s ] thds: 8 tps: 46.00 qps: 939.03 (r/w/o: 658.02/188.01/93.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 150s ] queue length: 0, concurrency: 1
[ 151s ] thds: 8 tps: 38.00 qps: 741.01 (r/w/o: 518.01/148.00/75.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 151s ] queue length: 0, concurrency: 0
[ 152s ] thds: 8 tps: 40.00 qps: 799.95 (r/w/o: 559.96/159.99/79.99) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 152s ] queue length: 0, concurrency: 0
[ 153s ] thds: 8 tps: 33.00 qps: 660.04 (r/w/o: 462.03/132.01/66.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 153s ] queue length: 0, concurrency: 0
[ 154s ] thds: 8 tps: 39.00 qps: 798.95 (r/w/o: 559.97/159.99/79.00) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 154s ] queue length: 0, concurrency: 1
[ 155s ] thds: 8 tps: 42.00 qps: 821.07 (r/w/o: 574.05/164.01/83.01) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 155s ] queue length: 0, concurrency: 0
[ 156s ] thds: 8 tps: 38.00 qps: 760.04 (r/w/o: 532.02/152.01/76.00) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 156s ] queue length: 0, concurrency: 0
[ 157s ] thds: 8 tps: 40.00 qps: 818.95 (r/w/o: 573.97/163.99/81.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 157s ] queue length: 0, concurrency: 1
[ 158s ] thds: 8 tps: 47.00 qps: 921.01 (r/w/o: 644.01/184.00/93.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 158s ] queue length: 0, concurrency: 0
[ 159s ] thds: 8 tps: 37.99 qps: 778.87 (r/w/o: 545.91/155.97/76.99) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 159s ] queue length: 0, concurrency: 2
[ 160s ] thds: 8 tps: 26.00 qps: 501.05 (r/w/o: 350.04/100.01/51.01) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 160s ] queue length: 0, concurrency: 0
[ 161s ] thds: 8 tps: 50.00 qps: 1000.03 (r/w/o: 700.02/200.01/100.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 161s ] queue length: 0, concurrency: 0
[ 162s ] thds: 8 tps: 37.00 qps: 740.00 (r/w/o: 518.00/148.00/74.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 162s ] queue length: 0, concurrency: 0
[ 163s ] thds: 8 tps: 40.00 qps: 800.00 (r/w/o: 560.00/160.00/80.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 163s ] queue length: 0, concurrency: 0
[ 164s ] thds: 8 tps: 31.00 qps: 620.02 (r/w/o: 434.01/124.00/62.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 164s ] queue length: 0, concurrency: 0
[ 165s ] thds: 8 tps: 36.00 qps: 720.00 (r/w/o: 504.00/144.00/72.00) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 165s ] queue length: 0, concurrency: 0
[ 166s ] thds: 8 tps: 36.99 qps: 739.89 (r/w/o: 517.93/147.98/73.99) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 166s ] queue length: 0, concurrency: 0
[ 167s ] thds: 8 tps: 36.01 qps: 720.12 (r/w/o: 504.09/144.02/72.01) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 167s ] queue length: 0, concurrency: 0
[ 168s ] thds: 8 tps: 45.99 qps: 919.89 (r/w/o: 643.92/183.98/91.99) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 168s ] queue length: 0, concurrency: 0
[ 169s ] thds: 8 tps: 47.00 qps: 940.03 (r/w/o: 658.02/188.01/94.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 169s ] queue length: 0, concurrency: 0
[ 170s ] thds: 8 tps: 48.00 qps: 960.05 (r/w/o: 672.03/192.01/96.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 170s ] queue length: 0, concurrency: 0
[ 171s ] thds: 8 tps: 44.00 qps: 879.97 (r/w/o: 615.98/175.99/88.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 171s ] queue length: 0, concurrency: 0
[ 172s ] thds: 8 tps: 27.00 qps: 540.01 (r/w/o: 378.01/108.00/54.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 172s ] queue length: 0, concurrency: 0
[ 173s ] thds: 8 tps: 40.00 qps: 819.03 (r/w/o: 574.02/164.01/81.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 173s ] queue length: 0, concurrency: 1
[ 174s ] thds: 8 tps: 38.00 qps: 740.96 (r/w/o: 517.97/147.99/75.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 174s ] queue length: 0, concurrency: 0
[ 175s ] thds: 8 tps: 46.00 qps: 919.97 (r/w/o: 643.98/183.99/92.00) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 175s ] queue length: 0, concurrency: 0
[ 176s ] thds: 8 tps: 27.00 qps: 540.05 (r/w/o: 378.04/108.01/54.01) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 176s ] queue length: 0, concurrency: 0
[ 177s ] thds: 8 tps: 42.00 qps: 839.98 (r/w/o: 587.98/168.00/84.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 177s ] queue length: 0, concurrency: 0
[ 178s ] thds: 8 tps: 46.00 qps: 919.96 (r/w/o: 643.97/183.99/92.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 178s ] queue length: 0, concurrency: 0
[ 179s ] thds: 8 tps: 46.00 qps: 920.05 (r/w/o: 644.03/184.01/92.00) lat (ms,95%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 179s ] queue length: 0, concurrency: 0
[ 180s ] thds: 8 tps: 47.00 qps: 939.94 (r/w/o: 657.96/187.99/93.99) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 180s ] queue length: 0, concurrency: 0
[ 181s ] thds: 8 tps: 40.00 qps: 838.04 (r/w/o: 588.03/168.01/82.00) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 181s ] queue length: 0, concurrency: 2
[ 182s ] thds: 8 tps: 36.00 qps: 682.00 (r/w/o: 476.00/136.00/70.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 182s ] queue length: 0, concurrency: 0
[ 183s ] thds: 8 tps: 40.00 qps: 800.03 (r/w/o: 560.02/160.01/80.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 183s ] queue length: 0, concurrency: 0
[ 184s ] thds: 8 tps: 36.00 qps: 738.99 (r/w/o: 517.99/148.00/73.00) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 184s ] queue length: 0, concurrency: 1
[ 185s ] thds: 8 tps: 46.00 qps: 913.04 (r/w/o: 641.03/180.01/92.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 185s ] queue length: 0, concurrency: 1
[ 186s ] thds: 8 tps: 43.00 qps: 847.96 (r/w/o: 590.97/171.99/85.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 186s ] queue length: 0, concurrency: 0
[ 187s ] thds: 8 tps: 45.00 qps: 900.02 (r/w/o: 630.01/180.00/90.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 187s ] queue length: 0, concurrency: 0
[ 188s ] thds: 8 tps: 33.00 qps: 659.98 (r/w/o: 461.98/132.00/66.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 188s ] queue length: 0, concurrency: 0
[ 189s ] thds: 8 tps: 38.00 qps: 760.02 (r/w/o: 532.01/152.00/76.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 189s ] queue length: 0, concurrency: 0
[ 190s ] thds: 8 tps: 43.00 qps: 859.98 (r/w/o: 601.99/172.00/86.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 190s ] queue length: 0, concurrency: 0
[ 191s ] thds: 8 tps: 27.00 qps: 540.01 (r/w/o: 378.01/108.00/54.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 191s ] queue length: 0, concurrency: 0
[ 192s ] thds: 8 tps: 31.00 qps: 620.02 (r/w/o: 434.01/124.00/62.00) lat (ms,95%): 28.67 err/s: 0.00 reconn/s: 0.00
[ 192s ] queue length: 0, concurrency: 0
[ 193s ] thds: 8 tps: 41.00 qps: 819.94 (r/w/o: 573.96/163.99/81.99) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 193s ] queue length: 1, concurrency: 0
[ 194s ] thds: 8 tps: 38.00 qps: 790.04 (r/w/o: 556.03/156.01/78.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 194s ] queue length: 0, concurrency: 2
[ 195s ] thds: 8 tps: 47.00 qps: 909.98 (r/w/o: 633.99/184.00/92.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 195s ] queue length: 0, concurrency: 0
[ 196s ] thds: 8 tps: 39.00 qps: 779.96 (r/w/o: 545.98/155.99/78.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 196s ] queue length: 0, concurrency: 0
[ 197s ] thds: 8 tps: 35.00 qps: 700.03 (r/w/o: 490.02/140.01/70.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 197s ] queue length: 0, concurrency: 0
[ 198s ] thds: 8 tps: 37.00 qps: 740.01 (r/w/o: 518.00/148.00/74.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 198s ] queue length: 0, concurrency: 0
[ 199s ] thds: 8 tps: 30.00 qps: 600.01 (r/w/o: 420.01/120.00/60.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 199s ] queue length: 0, concurrency: 0
[ 200s ] thds: 8 tps: 42.00 qps: 839.94 (r/w/o: 587.96/167.99/83.99) lat (ms,95%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 200s ] queue length: 0, concurrency: 0
[ 201s ] thds: 8 tps: 37.00 qps: 751.06 (r/w/o: 528.04/148.01/75.01) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 201s ] queue length: 0, concurrency: 1
[ 202s ] thds: 8 tps: 43.00 qps: 887.00 (r/w/o: 620.00/180.00/87.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 202s ] queue length: 0, concurrency: 2
[ 203s ] thds: 8 tps: 35.00 qps: 680.93 (r/w/o: 475.95/135.99/68.99) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 203s ] queue length: 0, concurrency: 1
[ 204s ] thds: 8 tps: 40.00 qps: 781.08 (r/w/o: 546.06/156.02/79.01) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 204s ] queue length: 0, concurrency: 0
[ 205s ] thds: 8 tps: 35.00 qps: 699.98 (r/w/o: 489.99/140.00/70.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 205s ] queue length: 0, concurrency: 0
[ 206s ] thds: 8 tps: 38.00 qps: 759.95 (r/w/o: 531.96/151.99/75.99) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 206s ] queue length: 0, concurrency: 0
[ 207s ] thds: 8 tps: 49.00 qps: 999.02 (r/w/o: 700.02/200.00/99.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 207s ] queue length: 0, concurrency: 1
[ 208s ] thds: 8 tps: 38.00 qps: 741.05 (r/w/o: 518.03/148.01/75.01) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 208s ] queue length: 0, concurrency: 0
[ 209s ] thds: 8 tps: 49.00 qps: 980.00 (r/w/o: 686.00/196.00/98.00) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 209s ] queue length: 0, concurrency: 0
[ 210s ] thds: 8 tps: 47.00 qps: 939.93 (r/w/o: 657.95/187.99/93.99) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 210s ] queue length: 0, concurrency: 0
[ 211s ] thds: 8 tps: 40.00 qps: 799.97 (r/w/o: 559.98/159.99/80.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 211s ] queue length: 0, concurrency: 0
[ 212s ] thds: 8 tps: 38.00 qps: 760.08 (r/w/o: 532.06/152.02/76.01) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 212s ] queue length: 0, concurrency: 0
[ 213s ] thds: 8 tps: 41.00 qps: 819.99 (r/w/o: 573.99/164.00/82.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 213s ] queue length: 0, concurrency: 0
[ 214s ] thds: 8 tps: 51.00 qps: 1020.01 (r/w/o: 714.00/204.00/102.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 214s ] queue length: 0, concurrency: 0
[ 215s ] thds: 8 tps: 37.00 qps: 739.99 (r/w/o: 517.99/148.00/74.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 215s ] queue length: 0, concurrency: 0
[ 216s ] thds: 8 tps: 43.00 qps: 859.98 (r/w/o: 601.99/172.00/86.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 216s ] queue length: 0, concurrency: 0
[ 217s ] thds: 8 tps: 40.00 qps: 800.03 (r/w/o: 560.02/160.01/80.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 217s ] queue length: 0, concurrency: 0
[ 218s ] thds: 8 tps: 39.00 qps: 780.01 (r/w/o: 546.00/156.00/78.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 218s ] queue length: 0, concurrency: 0
[ 219s ] thds: 8 tps: 38.00 qps: 759.97 (r/w/o: 531.98/151.99/76.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 219s ] queue length: 0, concurrency: 0
[ 220s ] thds: 8 tps: 43.00 qps: 885.05 (r/w/o: 625.04/172.01/88.01) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 220s ] queue length: 0, concurrency: 2
[ 221s ] thds: 8 tps: 30.00 qps: 574.99 (r/w/o: 396.99/120.00/58.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 221s ] queue length: 0, concurrency: 0
[ 222s ] thds: 8 tps: 36.00 qps: 735.00 (r/w/o: 518.00/144.00/73.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 222s ] queue length: 0, concurrency: 1
[ 223s ] thds: 8 tps: 51.00 qps: 1015.01 (r/w/o: 709.01/204.00/102.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 223s ] queue length: 0, concurrency: 1
[ 224s ] thds: 8 tps: 45.99 qps: 931.89 (r/w/o: 650.92/187.98/92.99) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 224s ] queue length: 0, concurrency: 2
[ 225s ] thds: 8 tps: 50.00 qps: 978.05 (r/w/o: 684.03/196.01/98.00) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 225s ] queue length: 0, concurrency: 0
[ 226s ] thds: 8 tps: 40.00 qps: 799.92 (r/w/o: 559.94/159.98/79.99) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 226s ] queue length: 0, concurrency: 0
[ 227s ] thds: 8 tps: 31.00 qps: 620.03 (r/w/o: 434.02/124.01/62.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 227s ] queue length: 0, concurrency: 0
[ 228s ] thds: 8 tps: 40.00 qps: 800.08 (r/w/o: 560.06/160.02/80.01) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 228s ] queue length: 0, concurrency: 0
[ 229s ] thds: 8 tps: 38.00 qps: 760.03 (r/w/o: 532.02/152.01/76.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 229s ] queue length: 0, concurrency: 0
[ 230s ] thds: 8 tps: 40.99 qps: 819.81 (r/w/o: 573.87/163.96/81.98) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 230s ] queue length: 0, concurrency: 0
[ 231s ] thds: 8 tps: 48.01 qps: 960.19 (r/w/o: 672.13/192.04/96.02) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 231s ] queue length: 0, concurrency: 0
[ 232s ] thds: 8 tps: 34.00 qps: 680.01 (r/w/o: 476.01/136.00/68.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 232s ] queue length: 0, concurrency: 0
[ 233s ] thds: 8 tps: 35.00 qps: 700.01 (r/w/o: 490.00/140.00/70.00) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 233s ] queue length: 0, concurrency: 0
[ 234s ] thds: 8 tps: 39.00 qps: 780.03 (r/w/o: 546.02/156.01/78.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 234s ] queue length: 0, concurrency: 0
[ 235s ] thds: 8 tps: 47.00 qps: 958.96 (r/w/o: 671.97/191.99/95.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 235s ] queue length: 0, concurrency: 1
[ 236s ] thds: 8 tps: 41.00 qps: 800.94 (r/w/o: 559.96/159.99/80.99) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 236s ] queue length: 0, concurrency: 0
[ 237s ] thds: 8 tps: 48.00 qps: 960.06 (r/w/o: 672.04/192.01/96.01) lat (ms,95%): 27.17 err/s: 0.00 reconn/s: 0.00
[ 237s ] queue length: 0, concurrency: 0
[ 238s ] thds: 8 tps: 33.00 qps: 660.01 (r/w/o: 462.01/132.00/66.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 238s ] queue length: 0, concurrency: 0
[ 239s ] thds: 8 tps: 36.00 qps: 719.96 (r/w/o: 503.97/143.99/72.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 239s ] queue length: 0, concurrency: 0
[ 240s ] thds: 8 tps: 41.00 qps: 820.06 (r/w/o: 574.04/164.01/82.01) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 240s ] queue length: 0, concurrency: 0
[ 241s ] thds: 8 tps: 39.00 qps: 779.96 (r/w/o: 545.97/155.99/78.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 241s ] queue length: 0, concurrency: 0
[ 242s ] thds: 8 tps: 39.00 qps: 780.02 (r/w/o: 546.01/156.00/78.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 242s ] queue length: 0, concurrency: 0
[ 243s ] thds: 8 tps: 33.00 qps: 659.99 (r/w/o: 461.99/132.00/66.00) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 243s ] queue length: 0, concurrency: 0
[ 244s ] thds: 8 tps: 45.00 qps: 900.01 (r/w/o: 630.00/180.00/90.00) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 244s ] queue length: 0, concurrency: 0
[ 245s ] thds: 8 tps: 41.00 qps: 820.00 (r/w/o: 574.00/164.00/82.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 245s ] queue length: 0, concurrency: 0
[ 246s ] thds: 8 tps: 43.00 qps: 859.98 (r/w/o: 601.98/172.00/86.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 246s ] queue length: 0, concurrency: 0
[ 247s ] thds: 8 tps: 31.00 qps: 620.04 (r/w/o: 434.03/124.01/62.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 247s ] queue length: 0, concurrency: 0
[ 248s ] thds: 8 tps: 41.00 qps: 838.96 (r/w/o: 587.97/167.99/83.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 248s ] queue length: 0, concurrency: 1
[ 249s ] thds: 8 tps: 43.00 qps: 847.02 (r/w/o: 593.01/168.00/86.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 249s ] queue length: 0, concurrency: 1
[ 250s ] thds: 8 tps: 43.00 qps: 873.01 (r/w/o: 611.01/176.00/86.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 250s ] queue length: 0, concurrency: 1
[ 251s ] thds: 8 tps: 46.00 qps: 900.98 (r/w/o: 629.99/180.00/91.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 251s ] queue length: 0, concurrency: 0
[ 252s ] thds: 8 tps: 34.00 qps: 698.95 (r/w/o: 489.96/139.99/68.99) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 252s ] queue length: 0, concurrency: 1
[ 253s ] thds: 8 tps: 43.00 qps: 841.09 (r/w/o: 588.07/168.02/85.01) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 253s ] queue length: 0, concurrency: 0
[ 254s ] thds: 8 tps: 42.00 qps: 839.97 (r/w/o: 587.98/167.99/84.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 254s ] queue length: 0, concurrency: 0
[ 255s ] thds: 8 tps: 44.00 qps: 880.01 (r/w/o: 616.01/176.00/88.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 255s ] queue length: 0, concurrency: 0
[ 256s ] thds: 8 tps: 51.00 qps: 1019.95 (r/w/o: 713.97/203.99/102.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 256s ] queue length: 0, concurrency: 0
[ 257s ] thds: 8 tps: 34.00 qps: 680.04 (r/w/o: 476.03/136.01/68.00) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 257s ] queue length: 0, concurrency: 0
[ 258s ] thds: 8 tps: 44.00 qps: 898.97 (r/w/o: 629.98/179.99/89.00) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 258s ] queue length: 0, concurrency: 1
[ 259s ] thds: 8 tps: 40.00 qps: 781.02 (r/w/o: 546.01/156.00/79.00) lat (ms,95%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 259s ] queue length: 0, concurrency: 0
[ 260s ] thds: 8 tps: 34.00 qps: 692.01 (r/w/o: 487.01/136.00/69.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 260s ] queue length: 0, concurrency: 1
[ 261s ] thds: 8 tps: 33.00 qps: 647.99 (r/w/o: 451.00/132.00/65.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 261s ] queue length: 0, concurrency: 0
[ 262s ] thds: 8 tps: 40.00 qps: 799.94 (r/w/o: 559.96/159.99/79.99) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 262s ] queue length: 0, concurrency: 0
[ 263s ] thds: 8 tps: 35.00 qps: 700.03 (r/w/o: 490.02/140.01/70.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 263s ] queue length: 0, concurrency: 0
[ 264s ] thds: 8 tps: 37.00 qps: 739.97 (r/w/o: 517.98/147.99/74.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 264s ] queue length: 0, concurrency: 0
[ 265s ] thds: 8 tps: 39.00 qps: 783.05 (r/w/o: 548.04/156.01/79.01) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 265s ] queue length: 0, concurrency: 1
[ 266s ] thds: 8 tps: 42.00 qps: 836.94 (r/w/o: 585.96/167.99/82.99) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 266s ] queue length: 0, concurrency: 0
[ 267s ] thds: 8 tps: 40.00 qps: 800.09 (r/w/o: 560.06/160.02/80.01) lat (ms,95%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 267s ] queue length: 0, concurrency: 0
[ 268s ] thds: 8 tps: 34.00 qps: 679.93 (r/w/o: 475.95/135.99/67.99) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 268s ] queue length: 0, concurrency: 1
[ 269s ] thds: 8 tps: 40.00 qps: 800.00 (r/w/o: 560.00/160.00/80.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 269s ] queue length: 0, concurrency: 0
[ 270s ] thds: 8 tps: 41.00 qps: 820.02 (r/w/o: 574.01/164.00/82.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 270s ] queue length: 0, concurrency: 0
[ 271s ] thds: 8 tps: 34.99 qps: 699.84 (r/w/o: 489.89/139.97/69.98) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 271s ] queue length: 0, concurrency: 0
[ 272s ] thds: 8 tps: 33.01 qps: 660.16 (r/w/o: 462.11/132.03/66.02) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 272s ] queue length: 0, concurrency: 0
[ 273s ] thds: 8 tps: 25.00 qps: 519.02 (r/w/o: 364.01/104.00/51.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 273s ] queue length: 0, concurrency: 1
[ 274s ] thds: 8 tps: 36.00 qps: 701.04 (r/w/o: 490.03/140.01/71.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 274s ] queue length: 0, concurrency: 0
[ 275s ] thds: 8 tps: 26.00 qps: 558.92 (r/w/o: 391.95/111.98/54.99) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 275s ] queue length: 0, concurrency: 2
[ 276s ] thds: 8 tps: 32.00 qps: 601.02 (r/w/o: 420.01/120.00/61.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 276s ] queue length: 0, concurrency: 0
[ 277s ] thds: 8 tps: 48.00 qps: 979.08 (r/w/o: 686.05/196.02/97.01) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 277s ] queue length: 0, concurrency: 1
[ 278s ] thds: 8 tps: 41.00 qps: 851.97 (r/w/o: 599.98/167.99/84.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 278s ] queue length: 0, concurrency: 3
[ 279s ] thds: 8 tps: 44.99 qps: 848.88 (r/w/o: 589.91/171.97/86.99) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 279s ] queue length: 0, concurrency: 1
[ 280s ] thds: 8 tps: 39.01 qps: 780.14 (r/w/o: 546.10/156.03/78.01) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 280s ] queue length: 0, concurrency: 0
[ 281s ] thds: 8 tps: 46.00 qps: 920.02 (r/w/o: 644.01/184.00/92.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 281s ] queue length: 0, concurrency: 0
[ 282s ] thds: 8 tps: 40.00 qps: 799.99 (r/w/o: 559.99/160.00/80.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 282s ] queue length: 0, concurrency: 0
[ 283s ] thds: 8 tps: 35.00 qps: 699.95 (r/w/o: 489.96/139.99/69.99) lat (ms,95%): 41.85 err/s: 0.00 reconn/s: 0.00
[ 283s ] queue length: 1, concurrency: 0
[ 284s ] thds: 8 tps: 44.00 qps: 880.04 (r/w/o: 616.03/176.01/88.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 284s ] queue length: 0, concurrency: 0
[ 285s ] thds: 8 tps: 49.00 qps: 1018.04 (r/w/o: 714.03/204.01/100.00) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 285s ] queue length: 0, concurrency: 2
[ 286s ] thds: 8 tps: 33.00 qps: 635.03 (r/w/o: 446.02/124.01/65.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 286s ] queue length: 0, concurrency: 1
[ 287s ] thds: 8 tps: 36.00 qps: 706.94 (r/w/o: 491.96/143.99/70.99) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 287s ] queue length: 0, concurrency: 0
[ 288s ] thds: 8 tps: 46.00 qps: 920.02 (r/w/o: 644.02/184.00/92.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 288s ] queue length: 0, concurrency: 0
[ 289s ] thds: 8 tps: 36.00 qps: 720.00 (r/w/o: 504.00/144.00/72.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 289s ] queue length: 0, concurrency: 0
[ 290s ] thds: 8 tps: 34.00 qps: 698.98 (r/w/o: 489.99/140.00/69.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 290s ] queue length: 0, concurrency: 1
[ 291s ] thds: 8 tps: 49.00 qps: 977.99 (r/w/o: 685.99/194.00/98.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 291s ] queue length: 0, concurrency: 1
[ 292s ] thds: 8 tps: 41.00 qps: 819.02 (r/w/o: 574.01/163.00/82.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 292s ] queue length: 0, concurrency: 1
[ 293s ] thds: 8 tps: 47.00 qps: 923.98 (r/w/o: 643.99/187.00/93.00) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 293s ] queue length: 0, concurrency: 0
[ 294s ] thds: 8 tps: 43.00 qps: 860.01 (r/w/o: 602.00/172.00/86.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 294s ] queue length: 0, concurrency: 0
[ 295s ] thds: 8 tps: 31.00 qps: 638.94 (r/w/o: 447.96/127.99/62.99) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 295s ] queue length: 1, concurrency: 2
[ 296s ] thds: 8 tps: 41.00 qps: 828.02 (r/w/o: 585.01/160.00/83.00) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 296s ] queue length: 0, concurrency: 2
[ 297s ] thds: 8 tps: 44.00 qps: 853.04 (r/w/o: 591.03/176.01/86.00) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 297s ] queue length: 0, concurrency: 0
[ 298s ] thds: 8 tps: 37.00 qps: 739.98 (r/w/o: 517.99/148.00/74.00) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 298s ] queue length: 0, concurrency: 0
[ 299s ] thds: 8 tps: 44.00 qps: 880.05 (r/w/o: 616.04/176.01/88.01) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 299s ] queue length: 0, concurrency: 0
[ 300s ] thds: 8 tps: 38.00 qps: 759.97 (r/w/o: 531.98/151.99/76.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 300s ] queue length: 0, concurrency: 0
SQL statistics:
    queries performed:
        read:                            168952
        write:                           48272
        other:                           24136
        total:                           241360
    transactions:                        12068  (40.22 per sec.)
    queries:                             241360 (804.42 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0386s
    total number of events:              12068

Latency (ms):
         min:                                    6.13
         avg:                                   10.66
         max:                                  107.64
         95th percentile:                       17.32
         sum:                               128653.39

Threads fairness:
    events (avg/stddev):           1508.5000/2.55
    execution time (avg/stddev):   16.0817/0.11